espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/bouffalolab/repo/components/platform/soc/bl702/bl702_std/BSP_Driver/hal_drv/src/hal_usb.c
    return 0;
}

int usb_write(struct device *dev, uint32_t pos, const void *buffer, uint32_t size)
{
    struct usb_dc_device *usb_device = (struct usb_dc_device *)dev;
    uint8_t ep_idx = USB_EP_GET_IDX(pos);

    if (usb_device->in_ep[ep_idx].ep_cfg.ep_type == USBD_EP_TYPE_ISOC) {
        uint32_t usb_ep_addr = USB_BASE + 0x308 + ep_idx * 0x10;

        dma_channel_stop(usb_device->tx_dma);
        usb_lli_list.src_addr = (uint32_t)buffer;
        usb_lli_list.dst_addr = usb_ep_addr;
        usb_lli_list.cfg.bits.TransferSize = size;
        usb_lli_list.cfg.bits.DI = 0;
        usb_lli_list.cfg.bits.SI = 1;
        usb_lli_list.cfg.bits.SBSize = DMA_BURST_16BYTE;
        usb_lli_list.cfg.bits.DBSize = DMA_BURST_1BYTE;
        dma_channel_update(usb_device->tx_dma, (void *)((uint32_t)&usb_lli_list));
        dma_channel_start(usb_device->tx_dma);
        return 0;
    } else {
    }

    return -1;
}

int usb_read(struct device *dev, uint32_t pos, void *buffer, uint32_t size)
{
    struct usb_dc_device *usb_device = (struct usb_dc_device *)dev;
    uint8_t ep_idx = USB_EP_GET_IDX(pos);

    if (usb_device->out_ep[ep_idx].ep_cfg.ep_type == USBD_EP_TYPE_ISOC) {
        uint32_t usb_ep_addr = USB_BASE + 0x308 + ep_idx * 0x1c;

        dma_channel_stop(usb_device->tx_dma);
        usb_lli_list.src_addr = usb_ep_addr;
        usb_lli_list.dst_addr = (uint32_t)buffer;
        usb_lli_list.cfg.bits.TransferSize = size;
        usb_lli_list.cfg.bits.DI = 1;
        usb_lli_list.cfg.bits.SI = 0;
        usb_lli_list.cfg.bits.SBSize = DMA_BURST_1BYTE;
        usb_lli_list.cfg.bits.DBSize = DMA_BURST_16BYTE;
        dma_channel_update(usb_device->rx_dma, (void *)((uint32_t)&usb_lli_list));
        dma_channel_start(usb_device->rx_dma);
        return 0;
    } else {
    }

    return -1;
}

/**
 * @brief
 *
 * @param index
 * @param name
 * @param flag
 * @return int
 */
int usb_dc_register(enum usb_index_type index, const char *name)
{
    struct device *dev;

    if (USB_MAX_INDEX == 0) {
        return -DEVICE_EINVAL;
    }

    memset(&usb_fs_device, 0, sizeof(usb_dc_device_t));

    dev = &(usb_fs_device.parent);

    dev->open = usb_open;
    dev->close = usb_close;
    dev->control = usb_control;
    dev->write = usb_write;
    dev->read = usb_read;

    dev->type = DEVICE_CLASS_USB;
    dev->handle = NULL;

    return device_register(dev, name);
}

/**
 * @brief Set USB device address
 *
 * @param[in] addr Device address
 *
 * @return 0 on success, negative errno code on fail.
 */
int usbd_set_address(const uint8_t addr)
{
    USB_Set_Device_Addr(addr);
    return 0;
}

/**
 * @brief configure and enable endpoint
 * This function sets endpoint configuration according to one specified in USB
 * endpoint descriptor and then enables it for data transfers.
 *
 * @param dev
 * @param ep_cfg  ep_cfg Endpoint
 * @return int
 */
int usbd_ep_open(const struct usb_dc_ep_cfg *ep_cfg)
{
    uint8_t ep;
    EP_Config_Type epCfg;

    if (!ep_cfg) {
        return -1;
    }

    ep = ep_cfg->ep_addr;

    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    USB_DC_LOG_DBG("%s ep %x, mps %d, type %d\r\n", __func__, ep, ep_cfg->ep_mps, ep_cfg->ep_type);

    if (ep_idx == 0) {
        return 0;
    }

    if (USB_EP_DIR_IS_OUT(ep)) {
        epCfg.dir = EP_OUT;
        epCfg.EPMaxPacketSize = ep_cfg->ep_mps;
        usb_fs_device.out_ep[ep_idx].ep_cfg.ep_mps = ep_cfg->ep_mps;
        usb_fs_device.out_ep[ep_idx].ep_cfg.ep_type = ep_cfg->ep_type;
    } else {
        epCfg.dir = EP_IN;
        epCfg.EPMaxPacketSize = ep_cfg->ep_mps;
        usb_fs_device.in_ep[ep_idx].ep_cfg.ep_mps = ep_cfg->ep_mps;
        usb_fs_device.in_ep[ep_idx].ep_cfg.ep_type = ep_cfg->ep_type;
    }

    switch (ep_cfg->ep_type) {
        case USBD_EP_TYPE_CTRL:
            epCfg.type = USB_DC_EP_TYPE_CTRL;
            break;

        case USBD_EP_TYPE_ISOC:
            epCfg.type = USB_DC_EP_TYPE_ISOC;
            break;

        case USBD_EP_TYPE_BULK:
            epCfg.type = USB_DC_EP_TYPE_BULK;
            break;

        case USBD_EP_TYPE_INTR:
            epCfg.type = USB_DC_EP_TYPE_INTR;
            break;

        default:
            return -1;
    }

    USB_Set_EPx_Config(ep_idx, &epCfg);

    if (USB_EP_DIR_IS_OUT(ep)) {
        /* Clear NAK and enable ep */
        USB_Set_EPx_Status(USB_EP_GET_IDX(ep), USB_EP_STATUS_ACK);
        usb_fs_device.out_ep[ep_idx].ep_ena = 1U;
    } else {
        //USB_Set_EPx_Status(USB_EP_GET_IDX(ep), USB_EP_STATUS_ACK);
        USB_Set_EPx_Status(USB_EP_GET_IDX(ep), USB_EP_STATUS_NACK);
        usb_fs_device.in_ep[ep_idx].ep_ena = 1U;
    }

    return 0;
}

int usbd_ep_close(const uint8_t ep)
{
    return 0;
}

/**
 * @brief Set stall condition for the selected endpoint
 *
 * @param[in] ep Endpoint address corresponding to the one
 *               listed in the device configuration table
 *
 * @return 0 on success, negative errno code on fail.
 */
int usbd_ep_set_stall(const uint8_t ep)
{
    uint32_t tmpVal = 0;
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    if (USB_EP_DIR_IS_OUT(ep)) {
        usb_fs_device.out_ep[ep_idx].is_stalled = 1U;
    } else {
        usb_fs_device.in_ep[ep_idx].is_stalled = 1U;
    }

    switch (ep_idx) {
        case 0:
            tmpVal = BL_RD_REG(USB_BASE, USB_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_USB_EP0_SW_STALL);
            BL_WR_REG(USB_BASE, USB_CONFIG, tmpVal);
            break;
        case 1:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP1_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP1_STALL);
            BL_WR_REG(USB_BASE, USB_EP1_CONFIG, tmpVal);
            break;
        case 2:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP2_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP2_STALL);
            BL_WR_REG(USB_BASE, USB_EP2_CONFIG, tmpVal);
            break;
        case 3:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP3_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP3_STALL);
            BL_WR_REG(USB_BASE, USB_EP3_CONFIG, tmpVal);
            break;
        case 4:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP4_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP4_STALL);
            BL_WR_REG(USB_BASE, USB_EP4_CONFIG, tmpVal);
            break;
        case 5:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP5_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP5_STALL);
            BL_WR_REG(USB_BASE, USB_EP5_CONFIG, tmpVal);
            break;
        case 6:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP6_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP6_STALL);
            BL_WR_REG(USB_BASE, USB_EP6_CONFIG, tmpVal);
            break;
        case 7:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP7_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP7_STALL);
            BL_WR_REG(USB_BASE, USB_EP7_CONFIG, tmpVal);
            break;

        default:
            break;
    }
    return 0;
}
/**
 * @brief Clear stall condition for the selected endpoint
 *
 * @param[in] ep Endpoint address corresponding to the one
 *               listed in the device configuration table
 *
 * @return 0 on success, negative errno code on fail.
 */
int usbd_ep_clear_stall(const uint8_t ep)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
    uint32_t tmpVal = 0;
    if (USB_EP_DIR_IS_OUT(ep)) {
        usb_fs_device.out_ep[ep_idx].is_stalled = 0;
    } else {
        usb_fs_device.in_ep[ep_idx].is_stalled = 0;
    }
    switch (ep_idx) {
        case 0:
            break;
        case 1:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP1_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP1_RDY);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP1_NACK);
            tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP1_STALL);
            BL_WR_REG(USB_BASE, USB_EP1_CONFIG, tmpVal);
            break;
        case 2:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP2_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP2_RDY);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP2_NACK);
            tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP2_STALL);
            BL_WR_REG(USB_BASE, USB_EP2_CONFIG, tmpVal);
            break;
        case 3:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP3_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP3_RDY);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP3_NACK);
            tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP3_STALL);
            BL_WR_REG(USB_BASE, USB_EP3_CONFIG, tmpVal);
            break;
        case 4:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP4_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP4_RDY);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP4_NACK);
            tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP4_STALL);
            BL_WR_REG(USB_BASE, USB_EP4_CONFIG, tmpVal);
            break;
        case 5:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP5_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP5_RDY);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP5_NACK);
            tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP5_STALL);
            BL_WR_REG(USB_BASE, USB_EP5_CONFIG, tmpVal);
            break;
        case 6:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP6_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP6_RDY);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP6_NACK);
            tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP6_STALL);
            BL_WR_REG(USB_BASE, USB_EP6_CONFIG, tmpVal);
            break;
        case 7:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP7_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP7_RDY);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP7_NACK);
            tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP7_STALL);
            BL_WR_REG(USB_BASE, USB_EP7_CONFIG, tmpVal);
            break;

        default:
            break;
    }
    return 0;
}

/**
 * @brief Check if the selected endpoint is stalled
 *
 * @param dev usb device
 * @param[in]  ep       Endpoint address corresponding to the one
 *                      listed in the device configuration table
 * @param[out] stalled  Endpoint stall status
 *
 * @return 0 on success, negative errno code on fail.
 */
int usbd_ep_is_stalled(struct device *dev, const uint8_t ep, uint8_t *stalled)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    if (!stalled) {
        return -1;
    }

